riv-ssek/bridge/src/test/resources/riv-requests/registerMedicalCertificateRequest.xml

<!--

    Copyright (C) 2013 Inera AB (http://www.inera.se)

    This file is part of Inera Axel (http://code.google.com/p/inera-axel).

    Inera Axel is free software: you can redistribute it and/or modify
    it under the terms of the GNU Lesser General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    Inera Axel is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU Lesser General Public License for more details.

    You should have received a copy of the GNU Lesser General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>

-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:add="http://www.w3.org/2005/08/addressing"
	xmlns:urn="urn:riv:insuranceprocess:healthreporting:RegisterMedicalCertificateResponder:3">
	<soap:Header>
		<add:To>TEST_RECEIVER</add:To>
	</soap:Header>
	<soap:Body>
		<urn:RegisterMedicalCertificate>TEST_PAYLOAD</urn:RegisterMedicalCertificate>
	</soap:Body>
</soap:Envelope>
